cfd/cases/robot_rest/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);
regions
(
    boxToCell
    {
        box (-999 -999 -999) (999 999 -0.010);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
    boxToFace
    {
        box (-999 -999 -999) (999 999 -0.010);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
);
