cfd/cases/robot_rest/system/topoSetDict.2
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// robot_simple 第 2 级加密盒，由 setup_robot.sh 生成
actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.2860 -0.1850 -0.1425) (0.1960 0.1850 0.0733);
    }
);
